# Core tools — needed for this dotfiles setup to work
brew "starship"     # prompt
brew "mise"         # tool version manager
brew "neovim"       # editor
brew "gh"           # github cli
brew "jq"           # json processing
brew "yq"           # yaml processing
brew "fzf"          # fuzzy finder
brew "fd"           # find alternative

# Safety
brew "macos-trash"  # move to Trash instead of rm -rf

# Development
brew "jj"           # jujutsu vcs (checkpointing safety net)
brew "ast-grep"     # structural code search
brew "actionlint"   # github actions linter
brew "uv"           # python package manager
brew "rtk"          # llm token-saving proxy

# AI
cask "claude-code"  # anthropic cli

# macOS casks
if OS.mac?
  cask "ghostty"        # terminal
  cask "1password-cli"  # secrets
end
